GopalSaraf/Practicals/PSDL/include/proc/pic18f26q84.inc
// Register: C1TXQUAU
#define C1TXQUAU C1TXQUAU
C1TXQUAU                                 equ 015Ah
// bitfield definitions
C1TXQUAU_TXQUA_POSN                      equ 0000h
C1TXQUAU_TXQUA_POSITION                  equ 0000h
C1TXQUAU_TXQUA_SIZE                      equ 0008h
C1TXQUAU_TXQUA_LENGTH                    equ 0008h
C1TXQUAU_TXQUA_MASK                      equ 00FFh
C1TXQUAU_TXQUA16_POSN                    equ 0000h
C1TXQUAU_TXQUA16_POSITION                equ 0000h
C1TXQUAU_TXQUA16_SIZE                    equ 0001h
C1TXQUAU_TXQUA16_LENGTH                  equ 0001h
C1TXQUAU_TXQUA16_MASK                    equ 0001h
C1TXQUAU_TXQUA17_POSN                    equ 0001h
C1TXQUAU_TXQUA17_POSITION                equ 0001h
C1TXQUAU_TXQUA17_SIZE                    equ 0001h
C1TXQUAU_TXQUA17_LENGTH                  equ 0001h
C1TXQUAU_TXQUA17_MASK                    equ 0002h
C1TXQUAU_TXQUA18_POSN                    equ 0002h
C1TXQUAU_TXQUA18_POSITION                equ 0002h
C1TXQUAU_TXQUA18_SIZE                    equ 0001h
C1TXQUAU_TXQUA18_LENGTH                  equ 0001h
C1TXQUAU_TXQUA18_MASK                    equ 0004h
C1TXQUAU_TXQUA19_POSN                    equ 0003h
C1TXQUAU_TXQUA19_POSITION                equ 0003h
C1TXQUAU_TXQUA19_SIZE                    equ 0001h
C1TXQUAU_TXQUA19_LENGTH                  equ 0001h
C1TXQUAU_TXQUA19_MASK                    equ 0008h
C1TXQUAU_TXQUA20_POSN                    equ 0004h
C1TXQUAU_TXQUA20_POSITION                equ 0004h
C1TXQUAU_TXQUA20_SIZE                    equ 0001h
C1TXQUAU_TXQUA20_LENGTH                  equ 0001h
C1TXQUAU_TXQUA20_MASK                    equ 0010h
C1TXQUAU_TXQUA21_POSN                    equ 0005h
C1TXQUAU_TXQUA21_POSITION                equ 0005h
C1TXQUAU_TXQUA21_SIZE                    equ 0001h
C1TXQUAU_TXQUA21_LENGTH                  equ 0001h
C1TXQUAU_TXQUA21_MASK                    equ 0020h
C1TXQUAU_TXQUA22_POSN                    equ 0006h
C1TXQUAU_TXQUA22_POSITION                equ 0006h
C1TXQUAU_TXQUA22_SIZE                    equ 0001h
C1TXQUAU_TXQUA22_LENGTH                  equ 0001h
C1TXQUAU_TXQUA22_MASK                    equ 0040h
C1TXQUAU_TXQUA23_POSN                    equ 0007h
C1TXQUAU_TXQUA23_POSITION                equ 0007h
C1TXQUAU_TXQUA23_SIZE                    equ 0001h
C1TXQUAU_TXQUA23_LENGTH                  equ 0001h
C1TXQUAU_TXQUA23_MASK                    equ 0080h

// Register: C1TXQUAT
#define C1TXQUAT C1TXQUAT
C1TXQUAT                                 equ 015Bh
// bitfield definitions
C1TXQUAT_TXQUA_POSN                      equ 0000h
C1TXQUAT_TXQUA_POSITION                  equ 0000h
C1TXQUAT_TXQUA_SIZE                      equ 0008h
C1TXQUAT_TXQUA_LENGTH                    equ 0008h
C1TXQUAT_TXQUA_MASK                      equ 00FFh
C1TXQUAT_TXQUA24_POSN                    equ 0000h
C1TXQUAT_TXQUA24_POSITION                equ 0000h
C1TXQUAT_TXQUA24_SIZE                    equ 0001h
C1TXQUAT_TXQUA24_LENGTH                  equ 0001h
C1TXQUAT_TXQUA24_MASK                    equ 0001h
C1TXQUAT_TXQUA25_POSN                    equ 0001h
C1TXQUAT_TXQUA25_POSITION                equ 0001h
C1TXQUAT_TXQUA25_SIZE                    equ 0001h
C1TXQUAT_TXQUA25_LENGTH                  equ 0001h
C1TXQUAT_TXQUA25_MASK                    equ 0002h
C1TXQUAT_TXQUA26_POSN                    equ 0002h
C1TXQUAT_TXQUA26_POSITION                equ 0002h
C1TXQUAT_TXQUA26_SIZE                    equ 0001h
C1TXQUAT_TXQUA26_LENGTH                  equ 0001h
C1TXQUAT_TXQUA26_MASK                    equ 0004h
C1TXQUAT_TXQUA27_POSN                    equ 0003h
C1TXQUAT_TXQUA27_POSITION                equ 0003h
C1TXQUAT_TXQUA27_SIZE                    equ 0001h
C1TXQUAT_TXQUA27_LENGTH                  equ 0001h
C1TXQUAT_TXQUA27_MASK                    equ 0008h
C1TXQUAT_TXQUA28_POSN                    equ 0004h
C1TXQUAT_TXQUA28_POSITION                equ 0004h
C1TXQUAT_TXQUA28_SIZE                    equ 0001h
C1TXQUAT_TXQUA28_LENGTH                  equ 0001h
C1TXQUAT_TXQUA28_MASK                    equ 0010h
C1TXQUAT_TXQUA29_POSN                    equ 0005h
C1TXQUAT_TXQUA29_POSITION                equ 0005h
C1TXQUAT_TXQUA29_SIZE                    equ 0001h
C1TXQUAT_TXQUA29_LENGTH                  equ 0001h
C1TXQUAT_TXQUA29_MASK                    equ 0020h
C1TXQUAT_TXQUA30_POSN                    equ 0006h
C1TXQUAT_TXQUA30_POSITION                equ 0006h
C1TXQUAT_TXQUA30_SIZE                    equ 0001h
C1TXQUAT_TXQUA30_LENGTH                  equ 0001h
C1TXQUAT_TXQUA30_MASK                    equ 0040h
C1TXQUAT_TXQUA31_POSN                    equ 0007h
C1TXQUAT_TXQUA31_POSITION                equ 0007h
C1TXQUAT_TXQUA31_SIZE                    equ 0001h
C1TXQUAT_TXQUA31_LENGTH                  equ 0001h
C1TXQUAT_TXQUA31_MASK                    equ 0080h

// Register: C1FIFOCON1
#define C1FIFOCON1 C1FIFOCON1
C1FIFOCON1                               equ 015Ch

// Register: C1FIFOCON1L
#define C1FIFOCON1L C1FIFOCON1L
C1FIFOCON1L                              equ 015Ch
// bitfield definitions
C1FIFOCON1L_TFNRFNIE_POSN                equ 0000h
C1FIFOCON1L_TFNRFNIE_POSITION            equ 0000h
C1FIFOCON1L_TFNRFNIE_SIZE                equ 0001h
C1FIFOCON1L_TFNRFNIE_LENGTH              equ 0001h
C1FIFOCON1L_TFNRFNIE_MASK                equ 0001h
C1FIFOCON1L_TFHRFHIE_POSN                equ 0001h
C1FIFOCON1L_TFHRFHIE_POSITION            equ 0001h
C1FIFOCON1L_TFHRFHIE_SIZE                equ 0001h
C1FIFOCON1L_TFHRFHIE_LENGTH              equ 0001h
C1FIFOCON1L_TFHRFHIE_MASK                equ 0002h
C1FIFOCON1L_TFERFFIE_POSN                equ 0002h
C1FIFOCON1L_TFERFFIE_POSITION            equ 0002h
C1FIFOCON1L_TFERFFIE_SIZE                equ 0001h
C1FIFOCON1L_TFERFFIE_LENGTH              equ 0001h
C1FIFOCON1L_TFERFFIE_MASK                equ 0004h
C1FIFOCON1L_RXOVIE_POSN                  equ 0003h
C1FIFOCON1L_RXOVIE_POSITION              equ 0003h
C1FIFOCON1L_RXOVIE_SIZE                  equ 0001h
C1FIFOCON1L_RXOVIE_LENGTH                equ 0001h
C1FIFOCON1L_RXOVIE_MASK                  equ 0008h
C1FIFOCON1L_TXATIE_POSN                  equ 0004h
C1FIFOCON1L_TXATIE_POSITION              equ 0004h
C1FIFOCON1L_TXATIE_SIZE                  equ 0001h
C1FIFOCON1L_TXATIE_LENGTH                equ 0001h
C1FIFOCON1L_TXATIE_MASK                  equ 0010h
C1FIFOCON1L_RXTSEN_POSN                  equ 0005h
C1FIFOCON1L_RXTSEN_POSITION              equ 0005h
C1FIFOCON1L_RXTSEN_SIZE                  equ 0001h
C1FIFOCON1L_RXTSEN_LENGTH                equ 0001h
C1FIFOCON1L_RXTSEN_MASK                  equ 0020h
C1FIFOCON1L_RTREN_POSN                   equ 0006h
C1FIFOCON1L_RTREN_POSITION               equ 0006h
C1FIFOCON1L_RTREN_SIZE                   equ 0001h
C1FIFOCON1L_RTREN_LENGTH                 equ 0001h
C1FIFOCON1L_RTREN_MASK                   equ 0040h
C1FIFOCON1L_TXEN_POSN                    equ 0007h
C1FIFOCON1L_TXEN_POSITION                equ 0007h
C1FIFOCON1L_TXEN_SIZE                    equ 0001h
C1FIFOCON1L_TXEN_LENGTH                  equ 0001h
C1FIFOCON1L_TXEN_MASK                    equ 0080h

// Register: C1FIFOCON1H
#define C1FIFOCON1H C1FIFOCON1H
C1FIFOCON1H                              equ 015Dh
// bitfield definitions
C1FIFOCON1H_UINC_POSN                    equ 0000h
C1FIFOCON1H_UINC_POSITION                equ 0000h
C1FIFOCON1H_UINC_SIZE                    equ 0001h
C1FIFOCON1H_UINC_LENGTH                  equ 0001h
C1FIFOCON1H_UINC_MASK                    equ 0001h
C1FIFOCON1H_TXREQ_POSN                   equ 0001h
C1FIFOCON1H_TXREQ_POSITION               equ 0001h
C1FIFOCON1H_TXREQ_SIZE                   equ 0001h
C1FIFOCON1H_TXREQ_LENGTH                 equ 0001h
C1FIFOCON1H_TXREQ_MASK                   equ 0002h
C1FIFOCON1H_FRESET_POSN                  equ 0002h
C1FIFOCON1H_FRESET_POSITION              equ 0002h
C1FIFOCON1H_FRESET_SIZE                  equ 0001h
C1FIFOCON1H_FRESET_LENGTH                equ 0001h
C1FIFOCON1H_FRESET_MASK                  equ 0004h

