GopalSaraf/Practicals/PSDL/include/proc/pic18f26q84.inc
// Register: C1FLTCON2T
#define C1FLTCON2T C1FLTCON2T
C1FLTCON2T                               equ 018Bh
// bitfield definitions
C1FLTCON2T_F11BP_POSN                    equ 0000h
C1FLTCON2T_F11BP_POSITION                equ 0000h
C1FLTCON2T_F11BP_SIZE                    equ 0005h
C1FLTCON2T_F11BP_LENGTH                  equ 0005h
C1FLTCON2T_F11BP_MASK                    equ 001Fh
C1FLTCON2T_FLTEN11_POSN                  equ 0007h
C1FLTCON2T_FLTEN11_POSITION              equ 0007h
C1FLTCON2T_FLTEN11_SIZE                  equ 0001h
C1FLTCON2T_FLTEN11_LENGTH                equ 0001h
C1FLTCON2T_FLTEN11_MASK                  equ 0080h
C1FLTCON2T_F11BP0_POSN                   equ 0000h
C1FLTCON2T_F11BP0_POSITION               equ 0000h
C1FLTCON2T_F11BP0_SIZE                   equ 0001h
C1FLTCON2T_F11BP0_LENGTH                 equ 0001h
C1FLTCON2T_F11BP0_MASK                   equ 0001h
C1FLTCON2T_F11BP1_POSN                   equ 0001h
C1FLTCON2T_F11BP1_POSITION               equ 0001h
C1FLTCON2T_F11BP1_SIZE                   equ 0001h
C1FLTCON2T_F11BP1_LENGTH                 equ 0001h
C1FLTCON2T_F11BP1_MASK                   equ 0002h
C1FLTCON2T_F11BP2_POSN                   equ 0002h
C1FLTCON2T_F11BP2_POSITION               equ 0002h
C1FLTCON2T_F11BP2_SIZE                   equ 0001h
C1FLTCON2T_F11BP2_LENGTH                 equ 0001h
C1FLTCON2T_F11BP2_MASK                   equ 0004h
C1FLTCON2T_F11BP3_POSN                   equ 0003h
C1FLTCON2T_F11BP3_POSITION               equ 0003h
C1FLTCON2T_F11BP3_SIZE                   equ 0001h
C1FLTCON2T_F11BP3_LENGTH                 equ 0001h
C1FLTCON2T_F11BP3_MASK                   equ 0008h
C1FLTCON2T_F11BP4_POSN                   equ 0004h
C1FLTCON2T_F11BP4_POSITION               equ 0004h
C1FLTCON2T_F11BP4_SIZE                   equ 0001h
C1FLTCON2T_F11BP4_LENGTH                 equ 0001h
C1FLTCON2T_F11BP4_MASK                   equ 0010h

// Register: C1FLTOBJ0
#define C1FLTOBJ0 C1FLTOBJ0
C1FLTOBJ0                                equ 018Ch

// Register: C1FLTOBJ0L
#define C1FLTOBJ0L C1FLTOBJ0L
C1FLTOBJ0L                               equ 018Ch
// bitfield definitions
C1FLTOBJ0L_SID_POSN                      equ 0000h
C1FLTOBJ0L_SID_POSITION                  equ 0000h
C1FLTOBJ0L_SID_SIZE                      equ 0008h
C1FLTOBJ0L_SID_LENGTH                    equ 0008h
C1FLTOBJ0L_SID_MASK                      equ 00FFh
C1FLTOBJ0L_SID0_POSN                     equ 0000h
C1FLTOBJ0L_SID0_POSITION                 equ 0000h
C1FLTOBJ0L_SID0_SIZE                     equ 0001h
C1FLTOBJ0L_SID0_LENGTH                   equ 0001h
C1FLTOBJ0L_SID0_MASK                     equ 0001h
C1FLTOBJ0L_SID1_POSN                     equ 0001h
C1FLTOBJ0L_SID1_POSITION                 equ 0001h
C1FLTOBJ0L_SID1_SIZE                     equ 0001h
C1FLTOBJ0L_SID1_LENGTH                   equ 0001h
C1FLTOBJ0L_SID1_MASK                     equ 0002h
C1FLTOBJ0L_SID2_POSN                     equ 0002h
C1FLTOBJ0L_SID2_POSITION                 equ 0002h
C1FLTOBJ0L_SID2_SIZE                     equ 0001h
C1FLTOBJ0L_SID2_LENGTH                   equ 0001h
C1FLTOBJ0L_SID2_MASK                     equ 0004h
C1FLTOBJ0L_SID3_POSN                     equ 0003h
C1FLTOBJ0L_SID3_POSITION                 equ 0003h
C1FLTOBJ0L_SID3_SIZE                     equ 0001h
C1FLTOBJ0L_SID3_LENGTH                   equ 0001h
C1FLTOBJ0L_SID3_MASK                     equ 0008h
C1FLTOBJ0L_SID4_POSN                     equ 0004h
C1FLTOBJ0L_SID4_POSITION                 equ 0004h
C1FLTOBJ0L_SID4_SIZE                     equ 0001h
C1FLTOBJ0L_SID4_LENGTH                   equ 0001h
C1FLTOBJ0L_SID4_MASK                     equ 0010h
C1FLTOBJ0L_SID5_POSN                     equ 0005h
C1FLTOBJ0L_SID5_POSITION                 equ 0005h
C1FLTOBJ0L_SID5_SIZE                     equ 0001h
C1FLTOBJ0L_SID5_LENGTH                   equ 0001h
C1FLTOBJ0L_SID5_MASK                     equ 0020h
C1FLTOBJ0L_SID6_POSN                     equ 0006h
C1FLTOBJ0L_SID6_POSITION                 equ 0006h
C1FLTOBJ0L_SID6_SIZE                     equ 0001h
C1FLTOBJ0L_SID6_LENGTH                   equ 0001h
C1FLTOBJ0L_SID6_MASK                     equ 0040h
C1FLTOBJ0L_SID7_POSN                     equ 0007h
C1FLTOBJ0L_SID7_POSITION                 equ 0007h
C1FLTOBJ0L_SID7_SIZE                     equ 0001h
C1FLTOBJ0L_SID7_LENGTH                   equ 0001h
C1FLTOBJ0L_SID7_MASK                     equ 0080h

// Register: C1FLTOBJ0H
#define C1FLTOBJ0H C1FLTOBJ0H
C1FLTOBJ0H                               equ 018Dh
// bitfield definitions
C1FLTOBJ0H_SID_POSN                      equ 0000h
C1FLTOBJ0H_SID_POSITION                  equ 0000h
C1FLTOBJ0H_SID_SIZE                      equ 0003h
C1FLTOBJ0H_SID_LENGTH                    equ 0003h
C1FLTOBJ0H_SID_MASK                      equ 0007h
C1FLTOBJ0H_EID_POSN                      equ 0003h
C1FLTOBJ0H_EID_POSITION                  equ 0003h
C1FLTOBJ0H_EID_SIZE                      equ 0005h
C1FLTOBJ0H_EID_LENGTH                    equ 0005h
C1FLTOBJ0H_EID_MASK                      equ 00F8h
C1FLTOBJ0H_SID8_POSN                     equ 0000h
C1FLTOBJ0H_SID8_POSITION                 equ 0000h
C1FLTOBJ0H_SID8_SIZE                     equ 0001h
C1FLTOBJ0H_SID8_LENGTH                   equ 0001h
C1FLTOBJ0H_SID8_MASK                     equ 0001h
C1FLTOBJ0H_SID9_POSN                     equ 0001h
C1FLTOBJ0H_SID9_POSITION                 equ 0001h
C1FLTOBJ0H_SID9_SIZE                     equ 0001h
C1FLTOBJ0H_SID9_LENGTH                   equ 0001h
C1FLTOBJ0H_SID9_MASK                     equ 0002h
C1FLTOBJ0H_SID10_POSN                    equ 0002h
C1FLTOBJ0H_SID10_POSITION                equ 0002h
C1FLTOBJ0H_SID10_SIZE                    equ 0001h
C1FLTOBJ0H_SID10_LENGTH                  equ 0001h
C1FLTOBJ0H_SID10_MASK                    equ 0004h
C1FLTOBJ0H_EID0_POSN                     equ 0003h
C1FLTOBJ0H_EID0_POSITION                 equ 0003h
C1FLTOBJ0H_EID0_SIZE                     equ 0001h
C1FLTOBJ0H_EID0_LENGTH                   equ 0001h
C1FLTOBJ0H_EID0_MASK                     equ 0008h
C1FLTOBJ0H_EID1_POSN                     equ 0004h
C1FLTOBJ0H_EID1_POSITION                 equ 0004h
C1FLTOBJ0H_EID1_SIZE                     equ 0001h
C1FLTOBJ0H_EID1_LENGTH                   equ 0001h
C1FLTOBJ0H_EID1_MASK                     equ 0010h
C1FLTOBJ0H_EID2_POSN                     equ 0005h
C1FLTOBJ0H_EID2_POSITION                 equ 0005h
C1FLTOBJ0H_EID2_SIZE                     equ 0001h
C1FLTOBJ0H_EID2_LENGTH                   equ 0001h
C1FLTOBJ0H_EID2_MASK                     equ 0020h
C1FLTOBJ0H_EID3_POSN                     equ 0006h
C1FLTOBJ0H_EID3_POSITION                 equ 0006h
C1FLTOBJ0H_EID3_SIZE                     equ 0001h
C1FLTOBJ0H_EID3_LENGTH                   equ 0001h
C1FLTOBJ0H_EID3_MASK                     equ 0040h
C1FLTOBJ0H_EID4_POSN                     equ 0007h
C1FLTOBJ0H_EID4_POSITION                 equ 0007h
C1FLTOBJ0H_EID4_SIZE                     equ 0001h
C1FLTOBJ0H_EID4_LENGTH                   equ 0001h
C1FLTOBJ0H_EID4_MASK                     equ 0080h

